app/views/cycles/edit.html.erb

SELECT "seeds"."name" FROM "seeds"
---

  <% all_seeds = Seed.all.pluck(:name) %>