app/views/cycles/new.html.erb


      <% all_seeds = Seed.all.pluck(:name) %>
---
SELECT "seeds"."name" FROM "seeds"