app/views/projects/show.html.erb

<h2>Cycles:</h2>
<% Cycle.first.repeat_alert %>
---
SELECT  "cycles".* FROM "cycles"   ORDER BY "cycles"."id" ASC LIMIT 1

	<p>Seeds:
		<% if Seedtag.where(cycle_id: cycle.id) %>
			<% Seedtag.where(cycle_id: cycle.id).each do |seedtag| %>
				<%= Seed.find(seedtag.seed_id).name %>,
			<% end %>
---
SELECT "seedtags".* FROM "seedtags"  WHERE "seedtags"."cycle_id" = 1
SELECT  "seeds".* FROM "seeds"  WHERE "seeds"."id" = $1 LIMIT 1  [["id", 1]]

<!-- lists participants -->
<ul><% Participant.where(project_id: @project.id).each do |participant| %>
---
SELECT "participants".* FROM "participants"  WHERE "participants"."project_id" = 1