app/views/seeds/index.html.erb

SELECT "projects".* FROM "projects"  WHERE "projects"."user_id" = 2
SELECT "cycles".* FROM "cycles"  WHERE "cycles"."project_id" = 11
SELECT "seedtags".* FROM "seedtags"  WHERE "seedtags"."cycle_id" = 8
SELECT  "seeds".* FROM "seeds"  WHERE "seeds"."id" = $1 LIMIT 1  [["id", 19]]
---
<% my_seeds = Array.new %>
<% Project.where(user_id: current_user.id).each do |project| %>
	<% Cycle.where(project_id: project.id).each do |cycle| %>
		<% Seedtag.where(cycle_id: cycle.id).each do |seedtag| %>
			<% my_seeds.push(Seed.find(seedtag.seed_id)) %>

SELECT "seeds".* FROM "seeds"
DELETE FROM "seeds" WHERE "seeds"."id" = 19
---

<% other_seeds = Seed.all %>
<% my_seeds.each do |my_seed| %>
	<% other_seeds.delete(my_seed) %>