app/controllers/cycles_controller.rb

	def create
		@cycle = Cycle.create(cycle_params.merge({project_id: params[:project_id]}))
		@cycle.end = @cycle.start.advance(:days => (@cycle.duration_days - 1))
		if @cycle.save
			ParticipantMailer.welcome_email(Participant.find_by(project_id: @cycle.project_id), ["Hello"]).deliver
			if params[:seed_names].present?
				params[:seed_names].each do |name|
					Seedtag.create(seed_id: Seed.find_by(name: name).id, cycle_id: @cycle.id, startdate: @cycle.start)
---
INSERT INTO "cycles" ("duration_days", "evening_alert", "morning_alert", "name", "project_id", "start") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["duration_days", 5], ["evening_alert", "2000-01-01 06:00:00.000000"], ["morning_alert", "2000-01-01 10:00:00.000000"], ["name", "cycle11"], ["project_id", 2], ["start", "2014-08-18"]]
UPDATE "cycles" SET "end" = $1 WHERE "cycles"."id" = 1  [["end", "2014-08-21"]]
SELECT  "participants".* FROM "participants"  WHERE "participants"."project_id" = 3 LIMIT 1
INSERT INTO "seedtags" ("cycle_id", "seed_id", "startdate") VALUES ($1, $2, $3) RETURNING "id"  [["cycle_id", 1], ["seed_id", 1], ["startdate", "2014-08-11"]]
SELECT  "seeds".* FROM "seeds"  WHERE "seeds"."name" = 'Leeks' LIMIT 1

	def edit
		@cycle = Cycle.find(params[:id])
---
SELECT  "cycles".* FROM "cycles"  WHERE "cycles"."id" = $1 LIMIT 1  [["id", 8]]

	def update
		@cycle = Cycle.find(params[:id])
		Seedtag.where(cycle_id: @cycle.id).destroy_all
		@cycle.end = @cycle.start.advance(:days => @cycle.duration_days)
		if @cycle.update(cycle_params)
			if params[:seed_names].present?
			  	params[:seed_names].each do |name|
					Seedtag.create(seed_id: Seed.find_by(name: name).id, cycle_id: @cycle.id, startdate: @cycle.start)
---
SELECT  "cycles".* FROM "cycles"  WHERE "cycles"."id" = $1 LIMIT 1  [["id", 8]]
DELETE FROM "seedtags" WHERE "seedtags"."id" = $1  [["id", 19]]
SELECT "seedtags".* FROM "seedtags"  WHERE "seedtags"."cycle_id" = 8
UPDATE "cycles" SET "evening_alert" = $1, "morning_alert" = $2 WHERE "cycles"."id" = 1  [["evening_alert", "2000-01-01 18:00:00.000000"], ["morning_alert", "2000-01-01 22:00:00.000000"]]
INSERT INTO "seedtags" ("cycle_id", "seed_id", "startdate") VALUES ($1, $2, $3) RETURNING "id"  [["cycle_id", 8], ["seed_id", 81], ["startdate", "2014-08-18"]]
SELECT  "seeds".* FROM "seeds"  WHERE "seeds"."name" = 'Alfafa' LIMIT 1

	def destroy
		cycle = Cycle.find(params[:id])
		project_id = cycle.project_id
		cycle.destroy
---
SELECT  "cycles".* FROM "cycles"  WHERE "cycles"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "cycles" WHERE "cycles"."id" = $1  [["id", 2]]