app/controllers/participants_controller.rb

	def create
		@participant = Participant.create(participant_params.merge({project_id: params[:project_id]}))
---
INSERT INTO "participants" ("email", "name", "project_id") VALUES ($1, $2, $3) RETURNING "id"  [["email", "katie@ix.com"], ["name", "Katie"], ["project_id", 1]]

	def destroy
		participant = Participant.find(params[:id])
		project_id = participant.project_id
		participant.destroy
---
SELECT  "participants".* FROM "participants"  WHERE "participants"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "participants" WHERE "participants"."id" = $1  [["id", 2]]