app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"  WHERE "projects"."user_id" = 1
---
	def index
		@projects = Project.all.where(user_id: current_user.id)

INSERT INTO "projects" ("name", "user_id") VALUES ($1, $2) RETURNING "id"  [["name", "project1"], ["user_id", 1]]
---
	def create
		@project = Project.create(project_params.merge({user_id: current_user.id}))

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 1]]
SELECT "projects".* FROM "projects"
---
	def destroy
		project = Project.find(params[:id])
		project.destroy
		if Project.all[0]