app/controllers/seeds_controller.rb

	def create
		@seed = Seed.create(seed_params)
---
INSERT INTO "seeds" ("family", "max_duration", "min_duration", "name", "nutrition", "tips") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["family", "blah"], ["max_duration", 5], ["min_duration", 3], ["name", "Rubbish"], ["nutrition", "blah"], ["tips", "blah"]]